# Python Relational Databases

Installing a package named as sqlalchemy which provides full SQL language functionality to be used in python.

In [1]:
conda install sqlalchemy

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

The SQLAlchemy is used to connect to a variety of relational sources including MySql, Oracle and Postgresql and Mssql. For this to happen, we first create a database engine and then connect to the database engine using the to_sql function of the SQLAlchemy library.

In [2]:
from sqlalchemy import create_engine
import pandas as pd
from pandas.io import sql

In [3]:
# read data
data = pd.read_csv('/Users/asumankabugo/Desktop/EMPLOYEE.csv')

In [4]:
#create a database engine
engine = create_engine('sqlite:///:memory:')

We create the relational table by using the to_sql function from a dataframe already created by reading a csv file.

In [5]:
#store the dataframe as a table
data.to_sql('data_table', engine)

Then we use the read_sql_query function from pandas to execute and capture the results from various SQL queries.

In [6]:
# Query 1 on the relational table
result1 = pd.read_sql_query('SELECT * FROM data_table', engine)
print('Result 1')
print(result1)
print('')

Result 1
   index  emp_id first_name Last_name  birth_date sex   salary  super_id  \
0      0     100      David   Wallace  17/11/1967   M  250,000       102
1      1     101        Jan  Levinson  11/05/1961   F  110,000       100
2      2     102    Michael     Scott  15/03/1964   M   75,000       100
3      3     103     Angela    Martin  25/06/1971   F   63,000       102
4      4     104      Kelly    Kapoor  05/02/1980   F   55,000       102
5      5     105    Stanley    Hudson  19/02/1958   M   69,000       102
6      6     106       Josh    Porter  05/09/1969   M   78,000       100
7      7     107       Andy   Bernard  22/07/1973   M   65,000       106
8      8     108        Jim   Halpert  01/10/1978   M   71,000       106

   branch_id
0          1
1          1
2          2
3          2
4          2
5          2
6          3
7          3
8          3

In [7]:
# Query 2 on the relational table
result2 = pd.read_sql_query('SELECT branch_id, sum(salary) FROM data_table group by branch_id', engine)
print('RESULT 2')
print(result2)
print('')

RESULT 2
   branch_id  sum(salary)
0          1        360.0
1          2        262.0
2          3        214.0

# Inserting Data to Relational Tables

We can also insert data into relational tables using sql.execute function available in pandas

In [8]:
# Insert another row
sql.execute('INSERT INTO data_table VALUES(?,?,?,?,?,?,?,?,?)', engine, params=[('emp_id',10,'Jack','Kimbo','27/03/1980','M','79,000','100','4')])

In [9]:
# Read from the relational table
result3 = pd.read_sql_query('SELECT emp_id, First_name, Last_name,birth_date, sex, salary, super_id, branch_id FROM data_table', engine)
print(result3)

   emp_id first_name Last_name  birth_date sex   salary  super_id  branch_id
0     100      David   Wallace  17/11/1967   M  250,000       102          1
1     101        Jan  Levinson  11/05/1961   F  110,000       100          1
2     102    Michael     Scott  15/03/1964   M   75,000       100          2
3     103     Angela    Martin  25/06/1971   F   63,000       102          2
4     104      Kelly    Kapoor  05/02/1980   F   55,000       102          2
5     105    Stanley    Hudson  19/02/1958   M   69,000       102          2
6     106       Josh    Porter  05/09/1969   M   78,000       100          3
7     107       Andy   Bernard  22/07/1973   M   65,000       106          3
8     108        Jim   Halpert  01/10/1978   M   71,000       106          3
9      10       Jack     Kimbo  27/03/1980   M   79,000       100          4

# Deleting Data from Relational Tables

We can also delete data into relational database using sql.execute function available in pandas

In [10]:
#delete data from data table
sql.execute('Delete from data_table where birth_date = (?) ', engine,  params=[('05/02/1980')])

In [11]:
#read from relational database
result4 = pd.read_sql_query('SELECT emp_id, First_name, Last_name,birth_date, sex, salary, super_id, branch_id FROM data_table', engine)
print(result4)

   emp_id first_name Last_name  birth_date sex   salary  super_id  branch_id
0     100      David   Wallace  17/11/1967   M  250,000       102          1
1     101        Jan  Levinson  11/05/1961   F  110,000       100          1
2     102    Michael     Scott  15/03/1964   M   75,000       100          2
3     103     Angela    Martin  25/06/1971   F   63,000       102          2
4     105    Stanley    Hudson  19/02/1958   M   69,000       102          2
5     106       Josh    Porter  05/09/1969   M   78,000       100          3
6     107       Andy   Bernard  22/07/1973   M   65,000       106          3
7     108        Jim   Halpert  01/10/1978   M   71,000       106          3
8      10       Jack     Kimbo  27/03/1980   M   79,000       100          4